In [1]:
import sqlalchemy
import pandas as pd
from login_info import my_password

In [2]:
#engine = sqlalchemy.create_engine('postgresql://postgres:postgres@localhost:5432/employees')
engine = sqlalchemy.create_engine(sqlalchemy.engine.url.URL.create(
        drivername="postgresql",
        username="postgres",
        password=my_password,
        host="localhost",
        port="5432",
        database="employees",
    ),
    echo_pool=True,
)
print("connecting with engine " + str(engine))
conn = engine.connect()

connecting with engine Engine(postgresql://postgres:***@localhost:5432/employees)

In [3]:
# List the employee number, last name, first name, sex, and salary 
# of each employee.
query1 = """
SELECT 	employees.emp_no, 
		employees.last_name, 
		employees.first_name, 
		employees.sex, salaries.salary 
FROM salaries 
JOIN employees ON employees.emp_no=salaries.emp_no
ORDER BY employees.emp_no; """

df1 = pd.read_sql_query(query1, conn)
print(len(df1))
df1.head()

300024

   emp_no last_name first_name sex  salary
0   10001   Facello     Georgi   M   60117
1   10002    Simmel    Bezalel   F   65828
2   10003   Bamford      Parto   M   40006
3   10004   Koblick  Chirstian   M   40054
4   10005  Maliniak    Kyoichi   M   78228

In [4]:
# List the first name, last name, and hire date for the employees 
# who were hired in 1986.

query2 = """
SELECT 	first_name, 
		last_name, 
		hire_date 
FROM employees 
WHERE (SELECT EXTRACT(YEAR FROM hire_date)) = 1986
ORDER BY hire_date; """

df2 = pd.read_sql_query(query2, conn)
print(len(df2))
df2.head()

36150

  first_name last_name   hire_date
0      Jiann   Bondorf  1986-01-01
1    Holgard    Prenel  1986-01-01
2   Hercules   Veevers  1986-01-01
3  Achilleas     Kroft  1986-01-01
4       Unal    Cooley  1986-01-01

In [5]:
# List the manager of each department along with their 
# department number, department name, employee number, last name, 
# and first name.

query3 = """
SELECT 	dept_manager.dept_no, 
		departments.dept_name, 
		dept_manager.emp_no,
		employees.last_name,
		employees.first_name
FROM dept_manager 
LEFT JOIN departments ON dept_manager.dept_no=departments.dept_no 
LEFT JOIN employees ON dept_manager.emp_no=employees.emp_no
ORDER BY dept_manager.dept_no; """

df3 = pd.read_sql_query(query3, conn)
df3

   dept_no           dept_name  emp_no     last_name   first_name
0     d001           Marketing  110022    Markovitch    Margareta
1     d001           Marketing  110039      Minakawa     Vishwani
2     d002             Finance  110085         Alpin         Ebru
3     d002             Finance  110114    Legleitner        Isamu
4     d003     Human Resources  110183  Ossenbruggen      Shirish
5     d003     Human Resources  110228       Sigstam      Karsten
6     d004          Production  110303       Wegerle    Krassimir
7     d004          Production  110344         Cools       Rosine
8     d004          Production  110386        Kieras         Shem
9     d004          Production  110420      Ghazalie        Oscar
10    d005         Development  110511      Hagimont     DeForest
11    d005         Development  110567      DasSarma         Leon
12    d006  Quality Management  110725       Onuegbe    Peternela
13    d006  Quality Management  110765       Hofmeyr       Rutger
14    d006  Quality Management  110800       Quadeer       Sanjoy
15    d006  Quality Management  110854         Pesch         Dung
16    d007               Sales  111035     Kaelbling  Przemyslawa
17    d007               Sales  111133         Zhang        Hauke
18    d008            Research  111400       Staelin         Arie
19    d008            Research  111534        Kambil       Hilary
20    d009    Customer Service  111692   Butterworth        Tonny
21    d009    Customer Service  111784    Giarratana        Marjo
22    d009    Customer Service  111877      Spinelli      Xiaobin
23    d009    Customer Service  111939       Weedman      Yuchang

In [6]:
# List the department number for each employee along with that 
# employeeâ€™s employee number, last name, first name, and department 
# name.

query4 = """
SELECT 	departments.dept_no,
		employees.emp_no,
		employees.last_name,
		employees.first_name,
		departments.dept_name
FROM employees
JOIN dept_emp ON employees.emp_no=dept_emp.emp_no
JOIN departments ON dept_emp.dept_no=departments.dept_no
ORDER BY departments.dept_no, employees.emp_no; """

df4 = pd.read_sql_query(query4, conn)
print(len(df4))
df4.head()

331603

  dept_no  emp_no  last_name first_name  dept_name
0    d001   10017  Bouloucos  Cristinel  Marketing
1    d001   10055     Dredge     Georgy  Marketing
2    d001   10058   McFarlin    Berhard  Marketing
3    d001   10108     Giveon     Lunjin  Marketing
4    d001   10140      Auria      Yucel  Marketing

In [7]:
# List first name, last name, and sex of each employee 
# whose first name is Hercules and whose last name begins 
# with the letter B.

query5 = """
SELECT 	first_name,
		last_name,
		sex
FROM employees
WHERE first_name = 'Hercules' AND last_name ~ '^B'
ORDER BY last_name; """

df5 = pd.read_sql_query(query5, conn)
df5

   first_name      last_name sex
0    Hercules           Baak   M
1    Hercules           Baer   M
2    Hercules           Bahr   M
3    Hercules           Bail   F
4    Hercules           Bain   F
5    Hercules     Baranowski   M
6    Hercules       Barreiro   M
7    Hercules        Basagni   M
8    Hercules       Benantar   F
9    Hercules     Benzmuller   M
10   Hercules  Bernardinello   F
11   Hercules      Bernatsky   M
12   Hercules        Berstel   F
13   Hercules          Biran   F
14   Hercules          Birge   F
15   Hercules          Biron   F
16   Hercules        Bisiani   F
17   Hercules         Bodoff   M
18   Hercules        Brendel   F
19   Hercules        Buchter   M

In [8]:
# List each employee in the Sales department, including 
# their employee number, last name, and first name.

query6 = """
SELECT  emp_no,
		last_name,
		first_name
FROM employees 
WHERE emp_no IN (
	SELECT emp_no FROM dept_emp 
	WHERE dept_no IN (
		SELECT dept_no FROM departments
		WHERE dept_name = 'Sales'
	)
)
ORDER BY emp_no; """

df6 = pd.read_sql_query(query6, conn)
print(len(df6))
df6.head()

52245

   emp_no    last_name first_name
0   10002       Simmel    Bezalel
1   10016  Cappelletti   Kazuhito
2   10034         Swan      Bader
3   10041       Lenart        Uri
4   10050       Dredge    Yinghua

In [9]:
# List each employee in the Sales and Development 
# departments, including their employee number, last 
# name, first name, and department name.

query7 = """
SELECT 	employees.emp_no,
		employees.last_name,
		employees.first_name,
		departments.dept_name
FROM employees
JOIN dept_emp ON employees.emp_no=dept_emp.emp_no
JOIN departments ON dept_emp.dept_no=departments.dept_no
WHERE departments.dept_name = 'Sales' OR
departments.dept_name = 'Development'
ORDER BY emp_no; """

df7 = pd.read_sql_query(query7, conn)
print(len(df7))
df7.head()

137952

   emp_no  last_name first_name    dept_name
0   10001    Facello     Georgi  Development
1   10002     Simmel    Bezalel        Sales
2   10006    Preusig     Anneke  Development
3   10008   Kalloufi     Saniya  Development
4   10012  Bridgland   Patricio  Development

In [10]:
# List the frequency counts, in descending order, of 
# all the employee last names (that is, how many employees 
# share each last name).

query8 = """
SELECT last_name, COUNT(last_name) AS last_name_count 
FROM employees 
GROUP BY last_name
ORDER BY last_name_count DESC; """

df8 = pd.read_sql_query(query8, conn)
print(len(df8))
df8.head()

1638

  last_name  last_name_count
0      Baba              226
1    Gelosh              223
2     Coorg              223
3    Farris              222
4   Sudbeck              222

In [11]:
conn.close()
engine.dispose()

2023-01-11 11:32:44,106 INFO sqlalchemy.pool.impl.QueuePool Pool disposed. Pool size: 5  Connections in pool: 0 Current Overflow: -5 Current Checked out connections: 0
2023-01-11 11:32:44,107 INFO sqlalchemy.pool.impl.QueuePool Pool recreating